# St7SetTHATemperatureLoadCase

Assigns the load case that specifies the nodal temperature distribution for transient heat analysis.

long St7SetTHATemperatureLoadCase(long uID, long CaseNum)

Input Parameters

uID

Strand7 model file ID.

Strand7 API Manual

CaseNum

Load case number.